; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 7054)
	(= (fuel plane1) 94)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at person1 city1)
	(at person2 city3)
	(at person3 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 526)
	(= (distance city0 city2) 948)
	(= (distance city0 city3) 542)
	(= (distance city0 city4) 805)
	(= (distance city0 city5) 662)
	(= (distance city0 city6) 544)
	(= (distance city1 city0) 526)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 675)
	(= (distance city1 city3) 847)
	(= (distance city1 city4) 703)
	(= (distance city1 city5) 645)
	(= (distance city1 city6) 532)
	(= (distance city2 city0) 948)
	(= (distance city2 city1) 675)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 622)
	(= (distance city2 city4) 507)
	(= (distance city2 city5) 733)
	(= (distance city2 city6) 742)
	(= (distance city3 city0) 542)
	(= (distance city3 city1) 847)
	(= (distance city3 city2) 622)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 886)
	(= (distance city3 city5) 511)
	(= (distance city3 city6) 803)
	(= (distance city4 city0) 805)
	(= (distance city4 city1) 703)
	(= (distance city4 city2) 507)
	(= (distance city4 city3) 886)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 932)
	(= (distance city4 city6) 611)
	(= (distance city5 city0) 662)
	(= (distance city5 city1) 645)
	(= (distance city5 city2) 733)
	(= (distance city5 city3) 511)
	(= (distance city5 city4) 932)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 918)
	(= (distance city6 city0) 544)
	(= (distance city6 city1) 532)
	(= (distance city6 city2) 742)
	(= (distance city6 city3) 803)
	(= (distance city6 city4) 611)
	(= (distance city6 city5) 918)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city6)
	(at person2 city0)
	(at person3 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city5)
   changed: (fuel plane1) from 94 to 7054
   goals met: 0 of 3
2. (zoom plane1 city5 city1)
   deleted: (at plane1 city5)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 3870, (fuel plane1) from 7054 to 3184
   goals met: 0 of 3
3. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 3
4. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 3
5. (fly plane1 city1 city6)
   deleted: (at plane1 city1)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 3870 to 5466, (fuel plane1) from 3184 to 1588
   goals met: 0 of 3
6. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 3
7. (refuel plane1 city6)
   changed: (fuel plane1) from 1588 to 7054
   goals met: 1 of 3
8. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 5466 to 7098, (fuel plane1) from 7054 to 5422
   goals met: 1 of 3
9. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 7098 to 8724, (fuel plane1) from 5422 to 3796
   goals met: 1 of 3
10. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 3
11. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 3
12. (zoom plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8724 to 11976, (fuel plane1) from 3796 to 544
   goals met: 2 of 3
13. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 3
